performance-results/test_20251112_165950.txt
Summary:
  Success rate:	100.00%
  Total:	10.0069 sec
  Slowest:	3.9313 sec
  Fastest:	0.0073 sec
  Average:	0.3609 sec
  Requests/sec:	284.2042

  Total data:	254.57 KiB
  Size/request:	95 B
  Size/sec:	25.44 KiB

Response time histogram:
  0.007 sec [1]    |
  0.400 sec [2330] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.792 sec [202]  |■■
  1.185 sec [72]   |
  1.577 sec [51]   |
  1.969 sec [32]   |
  2.362 sec [27]   |
  2.754 sec [9]    |
  3.147 sec [6]    |
  3.539 sec [3]    |
  3.931 sec [11]   |

Response time distribution:
  10.00% in 0.1717 sec
  25.00% in 0.1951 sec
  50.00% in 0.2353 sec
  75.00% in 0.3103 sec
  90.00% in 0.5349 sec
  95.00% in 1.1908 sec
  99.00% in 2.4535 sec
  99.90% in 3.7365 sec
  99.99% in 3.9313 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0004 sec, 0.0001 sec, 0.0060 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0010 sec

Status code distribution:
  [200] 2744 responses

Error distribution:
  [100] aborted due to deadline
Summary:
  Success rate:	100.00%
  Total:	460.1951 ms
  Slowest:	458.5979 ms
  Fastest:	2.0279 ms
  Average:	21.9811 ms
  Requests/sec:	2172.9915

  Total data:	49.80 KiB
  Size/request:	51 B
  Size/sec:	108.22 KiB

Response time histogram:
    2.028 ms [1]   |
   47.685 ms [966] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   93.342 ms [6]   |
  138.999 ms [4]   |
  184.656 ms [4]   |
  230.313 ms [4]   |
  275.970 ms [2]   |
  321.627 ms [2]   |
  367.284 ms [2]   |
  412.941 ms [3]   |
  458.598 ms [6]   |

Response time distribution:
  10.00% in 6.9255 ms
  25.00% in 10.0936 ms
  50.00% in 13.3373 ms
  75.00% in 20.5601 ms
  90.00% in 25.4994 ms
  95.00% in 29.2766 ms
  99.00% in 346.8867 ms
  99.90% in 458.5979 ms
  99.99% in 458.5979 ms


Details (average, fastest, slowest):
  DNS+dialup:	0.6939 ms, 0.3717 ms, 0.8514 ms
  DNS-lookup:	0.0141 ms, 0.0024 ms, 0.1271 ms

Status code distribution:
  [500] 1000 responses
Summary:
  Success rate:	100.00%
  Total:	4.7423 sec
  Slowest:	2.2012 sec
  Fastest:	0.0027 sec
  Average:	0.0472 sec
  Requests/sec:	2108.6977

  Total data:	498.05 KiB
  Size/request:	51 B
  Size/sec:	105.02 KiB

Response time histogram:
  0.003 sec [1]    |
  0.223 sec [9934] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.442 sec [13]   |
  0.662 sec [7]    |
  0.882 sec [7]    |
  1.102 sec [7]    |
  1.322 sec [7]    |
  1.542 sec [7]    |
  1.761 sec [6]    |
  1.981 sec [6]    |
  2.201 sec [5]    |

Response time distribution:
  10.00% in 0.0178 sec
  25.00% in 0.0317 sec
  50.00% in 0.0405 sec
  75.00% in 0.0470 sec
  90.00% in 0.0561 sec
  95.00% in 0.0738 sec
  99.00% in 0.1184 sec
  99.90% in 1.8180 sec
  99.99% in 2.1472 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0013 sec, 0.0007 sec, 0.0015 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0001 sec

Status code distribution:
  [500] 10000 responses
Summary:
  Success rate:	100.00%
  Total:	7.8885 sec
  Slowest:	1.5806 sec
  Fastest:	0.1313 sec
  Average:	0.3876 sec
  Requests/sec:	126.7671

  Total data:	546.91 KiB
  Size/request:	560 B
  Size/sec:	69.33 KiB

Response time histogram:
  0.131 sec [1]   |
  0.276 sec [157] |■■■■■■■
  0.421 sec [642] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.566 sec [124] |■■■■■■
  0.711 sec [26]  |■
  0.856 sec [0]   |
  1.001 sec [15]  |
  1.146 sec [20]  |
  1.291 sec [3]   |
  1.436 sec [5]   |
  1.581 sec [7]   |

Response time distribution:
  10.00% in 0.2356 sec
  25.00% in 0.2910 sec
  50.00% in 0.3318 sec
  75.00% in 0.4065 sec
  90.00% in 0.5048 sec
  95.00% in 0.9728 sec
  99.00% in 1.3876 sec
  99.90% in 1.5806 sec
  99.99% in 1.5806 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0006 sec, 0.0004 sec, 0.0009 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0001 sec

Status code distribution:
  [200] 1000 responses
Summary:
  Success rate:	100.00%
  Total:	30.0073 sec
  Slowest:	3.7729 sec
  Fastest:	0.0029 sec
  Average:	0.1002 sec
  Requests/sec:	998.4892

  Total data:	1.45 MiB
  Size/request:	51 B
  Size/sec:	49.56 KiB

Response time histogram:
  0.003 sec [1]     |
  0.380 sec [29785] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.757 sec [16]    |
  1.134 sec [10]    |
  1.511 sec [7]     |
  1.888 sec [7]     |
  2.265 sec [8]     |
  2.642 sec [7]     |
  3.019 sec [8]     |
  3.396 sec [6]     |
  3.773 sec [7]     |

Response time distribution:
  10.00% in 0.0531 sec
  25.00% in 0.0681 sec
  50.00% in 0.0881 sec
  75.00% in 0.1204 sec
  90.00% in 0.1290 sec
  95.00% in 0.1432 sec
  99.00% in 0.2779 sec
  99.90% in 2.1781 sec
  99.99% in 3.6513 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0010 sec, 0.0003 sec, 0.0018 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0001 sec

Status code distribution:
  [500] 29862 responses

Error distribution:
  [100] aborted due to deadline
Summary:
  Success rate:	73.54%
  Total:	8.6520 sec
  Slowest:	4.3263 sec
  Fastest:	0.0784 sec
  Average:	0.4688 sec
  Requests/sec:	577.9041

  Total data:	183.13 KiB
  Size/request:	51 B
  Size/sec:	21.17 KiB

Response time histogram:
  0.078 sec [1]    |
  0.503 sec [3096] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.928 sec [91]   |
  1.353 sec [52]   |
  1.778 sec [99]   |■
  2.202 sec [294]  |■■■
  2.627 sec [10]   |
  3.052 sec [0]    |
  3.477 sec [0]    |
  3.902 sec [0]    |
  4.326 sec [34]   |

Response time distribution:
  10.00% in 0.1808 sec
  25.00% in 0.1863 sec
  50.00% in 0.2007 sec
  75.00% in 0.3038 sec
  90.00% in 1.6819 sec
  95.00% in 2.0770 sec
  99.00% in 2.3055 sec
  99.90% in 4.1437 sec
  99.99% in 4.3263 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.2199 sec, 0.0001 sec, 4.0185 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0002 sec

Status code distribution:
  [500] 3677 responses

Error distribution:
  [485] connection error
  [339] timeout
  [283] Connection reset by peer (os error 54)
  [109] error writing a body to connection
  [99] operation was canceled
  [8] Invalid argument (os error 22)
Summary:
  Success rate:	100.00%
  Total:	6.7607 sec
  Slowest:	6.5419 sec
  Fastest:	0.0045 sec
  Average:	0.1327 sec
  Requests/sec:	739.5631

  Total data:	249.02 KiB
  Size/request:	51 B
  Size/sec:	36.83 KiB

Response time histogram:
  0.004 sec [1]    |
  0.658 sec [4932] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.312 sec [13]   |
  1.966 sec [10]   |
  2.619 sec [8]    |
  3.273 sec [8]    |
  3.927 sec [6]    |
  4.581 sec [7]    |
  5.234 sec [5]    |
  5.888 sec [6]    |
  6.542 sec [4]    |

Response time distribution:
  10.00% in 0.0430 sec
  25.00% in 0.0639 sec
  50.00% in 0.0935 sec
  75.00% in 0.1119 sec
  90.00% in 0.1397 sec
  95.00% in 0.1948 sec
  99.00% in 1.6000 sec
  99.90% in 5.8427 sec
  99.99% in 6.5419 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0019 sec, 0.0010 sec, 0.0025 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0005 sec

Status code distribution:
  [500] 5000 responses
Summary:
  Success rate:	99.67%
  Total:	11.8321 10 sec
  Slowest:	1.7445 10 sec
  Fastest:	0.0006 10 sec
  Average:	0.0237 10 sec
  Requests/sec:	845.1560

  Total data:	4.85 MiB
  Size/request:	51 B
  Size/sec:	41.95 KiB

Response time histogram:
  0.001 10 sec [1]     |
  0.175 10 sec [99528] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.349 10 sec [26]    |
  0.524 10 sec [20]    |
  0.698 10 sec [14]    |
  0.873 10 sec [15]    |
  1.047 10 sec [13]    |
  1.221 10 sec [15]    |
  1.396 10 sec [17]    |
  1.570 10 sec [8]     |
  1.744 10 sec [8]     |

Response time distribution:
  10.00% in 0.0128 10 sec
  25.00% in 0.0181 10 sec
  50.00% in 0.0245 10 sec
  75.00% in 0.0251 10 sec
  90.00% in 0.0271 10 sec
  95.00% in 0.0342 10 sec
  99.00% in 0.0351 10 sec
  99.90% in 0.4403 10 sec
  99.99% in 1.5559 10 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0131 10 sec, 0.0000 10 sec, 0.2017 10 sec
  DNS-lookup:	0.0000 10 sec, 0.0000 10 sec, 0.0000 10 sec

Status code distribution:
  [500] 99665 responses

Error distribution:
  [254] connection error
  [49] Connection reset by peer (os error 54)
  [15] operation was canceled
  [13] error writing a body to connection
  [4] Invalid argument (os error 22)